In [1]:
import pandas as pd

In [2]:
baby_names = pd.read_csv('https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/06_Stats/US_Baby_Names/US_Baby_Names_right.csv')

In [3]:
baby_names.head()

   Unnamed: 0     Id     Name  Year Gender State  Count
0       11349  11350     Emma  2004      F    AK     62
1       11350  11351  Madison  2004      F    AK     48
2       11351  11352   Hannah  2004      F    AK     46
3       11352  11353    Grace  2004      F    AK     44
4       11353  11354    Emily  2004      F    AK     41

## Delete the column 'Unnamed: 0' and 'Id'

In [4]:
del baby_names['Unnamed: 0']

In [5]:
del baby_names['Id']

In [6]:
baby_names.head()

      Name  Year Gender State  Count
0     Emma  2004      F    AK     62
1  Madison  2004      F    AK     48
2   Hannah  2004      F    AK     46
3    Grace  2004      F    AK     44
4    Emily  2004      F    AK     41

## count of male and female

In [10]:
baby_names['Gender'].value_counts()

F    558846
M    457549
Name: Gender, dtype: int64

## Group the dataset by name and assign to names

In [22]:
del baby_names['Year']
names = baby_names.groupby(['Name']).sum()

In [24]:
names.head()

         Count
Name
Aaban       12
Aadan       23
Aadarsh      5
Aaden     3426
Aadhav       6

In [25]:
names.sort_values('Count', ascending=False)

             Count
Name
Jacob       242874
Emma        214852
Michael     214405
Ethan       209277
Isabella    204798
...            ...
Eniola           5
Atlantis         5
Marci            5
Simarpreet       5
Nita             5

[17632 rows x 1 columns]

## How many different names exist in the dataset?

In [37]:
len(baby_names['Name'].value_counts())

#or

len(names)

17632

## What is the name with most occurrences

In [42]:
x = names.sort_values('Count', ascending=False)
x.head(1)

        Count
Name
Jacob  242874

In [46]:
# OR
names.Count.idxmax()

'Jacob'

## How many different names have the least occurrences?

In [56]:
len(names[names.Count==  names.Count.min()])

2578

## What is the median name occurrence?

In [ ]:
names[]